selection/app/views/admins/show.html.haml

SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 1 LIMIT 1
---
.container
  %h2= @applicant.first_name + ' ' + @applicant.last_name
  .table-responsive.transparent-container.applicant-profile
    .applicant-profile-picture