selection/app/controllers/admins/admin_applicant_controller.rb

  def dashboard
    @applicants = Applicant.all
---
SELECT `applicants`.* FROM `applicants`

  def dashboard_filter
    @applicants = Applicant.where(status: params[:status])
---
SELECT `applicants`.* FROM `applicants` WHERE `applicants`.`status` = 'basic'

  def show
    @applicant = Applicant.find(params[:id])
---
SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 3 LIMIT 1

  def search
    names = params[:search][:search_term].split(' ').join('|')
    @applicants = Applicant.where('first_name RLIKE ? OR last_name RLIKE ? OR email_address RLIKE ?',
                                  names, names, params[:search][:search_term])
---
SELECT `applicants`.* FROM `applicants` WHERE (first_name RLIKE 'tana' OR last_name RLIKE 'tana' OR email_address RLIKE 'tana')