selection/app/controllers/admins/options_controller.rb

  def filter
    @options = Option.where(['category = ?', category])
---
SELECT `options`.* FROM `options` WHERE (category = 'payment')

  def edit
    @option = Option.find(params[:id])
---
SELECT  `options`.* FROM `options` WHERE `options`.`id` = 3 LIMIT 1