selection/app/controllers/admins_controller.rb

SELECT `applicants`.* FROM `applicants`
---
  def dashboard
    @applicants = Applicant.all