selection/app/controllers/admins_controller.rb

SELECT `applicants`.* FROM `applicants`
---
  def list
    @applicants = Applicant.all

SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 1 LIMIT 1
---
  def show
    @applicant = Applicant.find(params[:id])