selection/app/controllers/applicants_controller.rb

SELECT `options`.`name` FROM `options` WHERE `options`.`category` = 'Education'
---
  def new
    @applicant = Applicant.new
    @span = Option.where(category: "Language").select(:message)
    @language = Option.where(category: "Language").select(:name)

INSERT INTO `applicants` (`first_name`, `last_name`, `email_address`, `phone_number`, `highest_education`, `english_knowledge`, `english_class`, `payment_option`, `created_at`, `updated_at`, `user_id`, `status`) VALUES ('Attila', 'Nagy', 'attilanagy002@gmail.com', '0036304770314', 'Primary school', 'Beginner', 'English', 'Prepayment-headhunting', '2017-12-22 14:22:23', '2017-12-22 14:22:23', 29, 'basic')
---
  def create
    @applicant = Applicant.new(applicant_params)
    if @applicant.save