selection/app/controllers/cvs_controller.rb

SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`user_id` = 4 LIMIT 1
---
  def create
    @cv = current_user.applicant.create_cv(cv_params)
    if @cv.errors.any?