selection/app/controllers/options_controller.rb

  def index
    @options = Option.where(["category = ?", params[:category]])
---
SELECT `options`.* FROM `options` WHERE (category = 'payment')

  def edit
    @option = Option.find(params[:id])
---
SELECT  `options`.* FROM `options` WHERE `options`.`id` = 5 LIMIT 1

  def update
    @option = Option.find(params[:id])
    if @option.update(option_params)
---
SELECT  `options`.* FROM `options` WHERE `options`.`id` = 5 LIMIT 1
UPDATE `options` SET `category` = 'payment', `updated_at` = '2017-12-22 14:49:20' WHERE `options`.`id` = 5