selection/app/controllers/profile_pictures_controller.rb

  def create
    @profile_picture = current_user.applicant.create_profile_picture(profile_picture_params)
    if @profile_picture.errors.any?
---
INSERT INTO `profile_pictures` (`upload_state`, `image_uid`, `created_at`, `updated_at`, `applicant_id`) VALUES ('awaiting_upload', '2018/01/05/8pr9yvl5dy_kari2017.jpg', '2018-01-05 17:51:46', '2018-01-05 17:51:46', 5)
SELECT  `applicants`.* FROM `applicants` WHERE `applicants`.`user_id` = 3 LIMIT 1
SELECT  `profile_pictures`.* FROM `profile_pictures` WHERE `profile_pictures`.`applicant_id` = 3 LIMIT 1